xmlsec/test/Resources/wsse/sign.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soap:mustUnderstand="1"><wsu:Timestamp wsu:Id="TS-14864704-99bb-45c7-8595-8f4820165f13"><wsu:Created>2024-03-12T07:51:16.475Z</wsu:Created><wsu:Expires>2024-03-12T08:06:16.475Z</wsu:Expires></wsu:Timestamp></wsse:Security></soap:Header><soap:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-a16fcb0e-3378-4a7e-849b-5757ee04ab44"><ns4:CheckInteroperability xmlns:ns4="http://www.swissdec.ch/schema/sd/20200220/SalaryDeclarationServiceTypes" xmlns="http://www.swissdec.ch/schema/common/20200220/Common" xmlns:ns2="http://www.swissdec.ch/schema/sd/20200220/SalaryDeclarationContainer" xmlns:ns3="http://www.swissdec.ch/schema/sd/20200220/SalaryDeclaration"><UserAgent><Producer>itServe AG</Producer><Name>RefApps-Transmitter</Name><Version>0.0</Version><StandardVersion>5.0</StandardVersion><Certificate>9999.99</Certificate></UserAgent><UmlautString>ÄËÖÜÁÉÓÚÀÈÒÙÂÊÔÛ</UmlautString><FirstOperand>999000000000.00</FirstOperand><SecondOperand>10.50</SecondOperand><SystemDateTime>2024-03-12T08:51:16.075+01:00</SystemDateTime><MonitoringID>bossinfo</MonitoringID></ns4:CheckInteroperability></soap:Body></soap:Envelope>
